/*
 * sdk_main.c
 *
 *  Created on: 2020年6月3日
 *      Author: Administrator
 */
#include "xparameters.h"
#include "xstatus.h"
#include "stdio.h"
#include "ff.h"
#include "xtime_l.h"

#include "cnn_svm.h"

u8 Img[10000][28][28];
u8 Res[10000];
u8 Label[10000];

static FATFS fatfs;
int SD_Init(void)
{
	FRESULT res;

	res = f_mount(&fatfs, "", 0);
	if(res)
	{
		xil_printf("f_mount error, return %d\r\n", res);
		return XST_FAILURE;
	}
	return XST_SUCCESS;
}

int SD_ReadImgLabel(void)
{
	u8 *pRead = Img[0][0];
	FIL file;
	FRESULT res;
	UINT br;
	DWORD fsize;

	xil_printf("测试数据集：MNIST\r\n");

	//1w张输入图像
	res = f_open(&file, "img.bin", FA_READ);
	if(res)
	{
		xil_printf("img.bin return %d.\r\n", res);
		return XST_FAILURE;
	}
	f_lseek(&file, 16);
	fsize = 10000*28*28*sizeof(u8);
	res = f_read(&file, (void*)pRead, fsize, &br);
	f_close(&file);
	xil_printf("读取img.bin完成!\r\n");

	pRead = (u8 *)Label;
	res = f_open(&file, "lab.bin", FA_READ);
	if(res)
	{
		xil_printf("lab.bin return %d.\r\n", res);
		return XST_FAILURE;
	}
	f_lseek(&file, 8);
	fsize = 10000*sizeof(u8);
	res = f_read(&file, (void*)pRead, fsize, &br);
	f_close(&file);
	xil_printf("读取lab.bin完成!\r\n");

	xil_printf("测试图片数量：10000\r\n");

	return XST_SUCCESS;
}

u8 image1[28][28]={
//im1
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,169,207,33,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,168,254,105,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,84,249,254,105,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,89,254,254,105,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,89,254,193,14,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,89,254,184,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,7,204,254,184,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,89,254,184,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,13,209,254,178,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,37,209,254,254,69,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,107,254,254,254,184,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,3,187,254,254,134,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,185,254,155,3,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,185,254,238,7,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,185,254,254,8,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,185,254,231,7,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,185,255,87,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,173,254,87,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,9,254,87,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,9,254,87,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,},
{0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,}
};

int main(void)
{
	int suc=0, fail=0;
	XTime Time_T0=0, Time_T1=0;
	int Timeconsume=0;
	xil_printf("开始CNN_Lite+SVM网络测试\r\n");
	SD_Init();
	SD_ReadImgLabel();

	XTime_GetTime(&Time_T0);
	for(int i=0; i<10000; i++)
	{
		Res[i] = cnn_svm(Img[i]);
	}
	XTime_GetTime(&Time_T1);
	Timeconsume = (Time_T1-Time_T0)*3/100;
	printf("网络测试完成!\n");
	xil_printf("时间消耗是%dus!\n", Timeconsume);

	for(int i=0; i<10000; i++)
	{
		if(Res[i]==Label[i])
			suc++;
		else
			fail++;
	}

	printf("正确图片数量: %d\n", suc);
	printf("错误图片数量: %d\n", fail);
	printf("测试准确度为: Accuracy = %.2f%%\r\n", (float)(suc)*100/10000);

	return 0;
}

